Revit 2027 API
XYZ.Negate Method
Negates this vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Negate()
Public Function Negate As XYZ
public:
XYZ^ Negate()
member Negate : unit -> XYZ
Return Value
XYZ
The vector opposite to this vector.
Remarks
 The negated vector is obtained by changing the sign of each coordinate of this vector.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace